In [187]:
import pandas as pd

In [188]:
import numpy as np
df = pd.DataFrame({
    "a": [4, 5, 6, 6, np.nan],
    "b": [7, 8, np.nan, 9, 9,],
    "c": [10, 11, 12, np.nan, 12]
},
    index = [1, 2, 3, 4, 5]
)

In [189]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [190]:
df[(df.a > 4) & (df.c <12)]

     a    b     c
2  5.0  8.0  11.0

In [191]:
df.describe()

              a         b          c
count  4.000000  4.000000   4.000000
mean   5.250000  8.250000  11.250000
std    0.957427  0.957427   0.957427
min    4.000000  7.000000  10.000000
25%    4.750000  7.750000  10.750000
50%    5.500000  8.500000  11.500000
75%    6.000000  9.000000  12.000000
max    6.000000  9.000000  12.000000

In [192]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [193]:
df = df.drop_duplicates(keep='last')

In [194]:
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [195]:
df[df['b'] != 7]

     a    b     c
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [196]:
df.a.isin([5,5])

1    False
2     True
3    False
4    False
5    False
Name: a, dtype: bool

In [197]:
df.isnull()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [198]:
pd.isnull(df)

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [199]:
df['a'].isnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

In [200]:
df.a.notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [201]:
df[df.b == 7] | df[df.b == 5]

    a   b   c
1 NaN NaN NaN

In [202]:
df.sample(frac=0.25)

     a    b     c
2  5.0  8.0  11.0

In [203]:
df.sample(n=5)
df

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [204]:
df.iloc[3:]

     a    b     c
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [205]:
df.iloc[0:2]

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0

In [208]:
df.nlargest?

In [210]:
df = pd.DataFrame({
    'a': [1, 10, 8, 11, -1],
    'b': list('abcde'),
    'c': [1.0, 2.0, np.nan, 3.0, 4.0]
})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [215]:
df.nlargest(3, 'c')

    a  b    c
4  -1  e  4.0
3  11  d  3.0
1  10  b  2.0

In [216]:
df.nsmallest(1, 'a')

   a  b    c
4 -1  e  4.0